app/controllers/stories_controller.rb

SELECT * FROM "stories" ORDER BY created_at DESC LIMIT 5 OFFSET 0
SELECT count(*) AS count_all FROM "stories"
---
  def index
    page = 1
    page = params[:page] if params[:page]
    @stories = Story.paginate :page => page, :order => 'created_at DESC', :per_page => 5

SELECT * FROM "stories" WHERE ("stories"."permalink" = 'how-to-tutorial-on-developing-facebook-application-using-ruby-on-rails-part-i') LIMIT 1
---
  def show
    @story = Story.find_by_permalink(params[:id])

SELECT * FROM "stories" WHERE ("stories"."permalink" = 'how-to-tutorial-on-developing-facebook-application-using-ruby-on-rails-part-i') LIMIT 1
INSERT INTO "stories" ("created_at", "title", "updated_at", "url", "rolled", "user_id", "description") VALUES('2009-03-06 18:16:37', 'How To: Tutorial on developing a Facebook application using Ruby on Rails (Part I)', '2009-03-06 18:16:37', 'http://rfacebook.wordpress.com/2008/01/10/tutorial/', 1, NULL, 'How To: Tutorial on developing a Facebook application using Ruby on Rails (Part I)')
---
  def create
    @story = current_user.stories.new(params[:story])
    @story.permalink = create_permalink(@story.title)

    @story.permalink += "-#{Time.now.to_i}" if Story.find_by_permalink(@story.permalink)

    respond_to do |format|
      if @story.save

SELECT * FROM "stories" WHERE ("stories"."id" = 996332884)
DELETE FROM "stories" WHERE "id" = 996332884
---
  def destroy
    @story = Story.find(params[:id])
    @story.destroy

SELECT * FROM "stories" WHERE ("stories"."id" = 1)
SELECT * FROM "votes" WHERE ("votes"."user_id" = 1) AND ("votes".story_id = 2) LIMIT 1
INSERT INTO "votes" ("created_at", "updated_at", "user_id", "story_id") VALUES('2009-03-11 13:41:20', '2009-03-11 13:41:20', 1, 1)
UPDATE "stories" SET "updated_at" = '2009-03-11 13:41:20', "rolled" = 2 WHERE "id" = 1
---
  def vote
    Story.transaction do
      Vote.transaction do
        @story = Story.find(params[:id])
        if @story.user_id != current_user.id
          @already_voted = @story.votes.find_by_user_id(current_user.id)
          unless @already_voted
            @story.rolled += 1
            @story.votes.build(:user_id => current_user.id)
            @story.save